{
  "html": 12246,
  "databricks": 12244,
  "redux": 12222,
  "terraform": 12187,
  "angular": 12173,
  "figma": 12157,
  "salesforce-crm": 12157,
  "vue.js": 12142,
  "sales": 12138,
  "accounting": 12136,
  "agile": 12135,
  "kafka": 12114,
  "excel": 12109,
  "bigquery": 12108,
  "ci/cd": 12108,
  "project-management": 12106,
  "airflow": 12105,
  "aws": 12104,
  "flask": 12104,
  "scrum": 12083,
  "illustrator": 12072,
  "kubernetes": 12071,
  "etl": 12068,
  "css": 12065,
  "docker": 12062,
  "next.js": 12058,
  "apache-beam": 12054,
  "java": 12049,
  "go": 12049,
  "typescript": 12048,
  "javascript": 12047,
  "dbt": 12046,
  "rest-apis": 12040,
  "spark": 12038,
  "marketing": 12037,
  "tally": 12030,
  "graphql": 12027,
  "snowflake": 12027,
  "webpack": 12026,
  "six-sigma": 11991,
  "seo": 11990,
  "sap": 11989,
  "gcp": 11983,
  "postgresql": 11983,
  "rust": 11960,
  "apache-flink": 11958,
  "grpc": 11957,
  "content-writing": 11948,
  "sql": 11935,
  "hadoop": 11931,
  "redis": 11928,
  "tailwind": 11917,
  "photoshop": 11917,
  "fastapi": 11917,
  "microservices": 11909,
  "powerpoint": 11908,
  "spring-boot": 11906,
  "data-pipelines": 11905,
  "django": 11899,
  "mongodb": 11841,
  "node.js": 11838,
  "azure": 11828,
  "react": 11811,
  "hugging-face-transformers": 5163,
  "langchain": 5162,
  "information-retrieval": 5135,
  "llms": 5094,
  "recommendation-systems": 5091,
  "semantic-search": 5087,
  "sentence-transformers": 5081,
  "embeddings": 5080,
  "vector-search": 5065,
  "prompt-engineering": 5062,
  "pinecone": 5062,
  "vector search": 5052,
  "rag": 4995,
  "fine-tuning-llms": 4920,
  "yolo": 4827,
  "gans": 4815,
  "feature-engineering": 4809,
  "opencv": 4803,
  "asr": 4788,
  "image-classification": 4761,
  "computer-vision": 4755,
  "speech-recognition": 4744,
  "cnn": 4740,
  "kubeflow": 4730,
  "mlops": 4727,
  "bentoml": 4726,
  "data-science": 4708,
  "reinforcement-learning": 4708,
  "object-detection": 4705,
  "diffusion-models": 4701,
  "mlflow": 4691,
  "time-series": 4686,
  "weights-&-biases": 4685,
  "forecasting": 4676,
  "tts": 4669,
  "statistical-modeling": 4634,
  "qlora": 1401,
  "pgvector": 1394,
  "weaviate": 1389,
  "milvus": 1384,
  "learning-to-rank": 1383,
  "bm25": 1382,
  "tensorflow": 1381,
  "qdrant": 1379,
  "python": 1378,
  "pytorch": 1378,
  "peft": 1377,
  "lora": 1371,
  "nlp": 1358,
  "machine-learning": 1349,
  "deep-learning": 1342,
  "haystack": 1333,
  "elasticsearch": 1311,
  "llamaindex": 1308,
  "scikit-learn": 1288,
  "opensearch": 1286,
  "information-retrieval-systems": 7,
  "search-backend": 5,
  "text-encoders": 5,
  "vector-representations": 4,
  "content-matching": 4,
  "model-adaptation": 4,
  "ranking-systems": 4,
  "search-&-discovery": 4,
  "workflow-orchestration": 3,
  "search-infrastructure": 3,
  "indexing-algorithms": 3,
  "open-source-ml-libraries": 3,
  "natural-language-processing": 2,
  "document-processing": 1
}